public/blog/posts/why.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2024-11-24 Sun 13:09 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Morgan Kothman</title>
<meta name="author" content="Morgan Kothman">
<meta name="description" content="Morgan is a tech support specialist in Michigan,
focusing on making technology more accessible for the
average person.">
<meta name="keywords" content="Morgan Kothman, tech support, tech support specialist, tech accessibility">
<meta name="generator" content="Org Mode">
<link rel="stylesheet" href="https://kothman.github.io/styles.css?busted=1732471781"><link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/bootstrap-icons@1.11.3/font/bootstrap-icons.min.css">
</head>
<body>
<div id="preamble" class="status">
<header><nav><ul><li><a href="https://kothman.github.io"><h1>Morgan Kothman</h1><h3>tech support for the people</h3></a><li id="nav-home"><a href="https://kothman.github.io/">home</a></li><li id="nav-blog"><a href="https://kothman.github.io/blog/">blog</a></li><li id="nav-contact"><a href="mailto:mari.morcant@gmail.com">mari.morcant@gmail.com</a></li></ul></nav></header>
</div>
<div id="content" class="content">
<div id="content-subcontainer" class="content-subcontainer">
<div id="outline-container-org5fc3b64" class="outline-1">
<h1 id="org5fc3b64">Why do it that way, silly?</h1>
<div class="outline-text-1" id="text-org5fc3b64">
</div>
<div id="outline-container-org5137486" class="outline-4">
<h4 id="org5137486"><span class="timestamp-wrapper"><span class="timestamp">Saturday, November 23, 2024</span></span></h4>
</div>
<div id="outline-container-org599ec02" class="outline-2">
<h2 id="org599ec02">Welcome to my blog!</h2>
<div class="outline-text-2" id="text-org599ec02">
<p>
This is an introductory post about why I made this website the way I did.
</p>

<p>
Because we live in a world where capitalism rules every moment of our waking
lives, it's advantageous for me to blog about my adventures in programming, so
that anyone with an inclination to interview or hire me might better understand
my dedication to the craft. Also, it's a nice way to do a retrospective on what
I've accomplished, what I've learned, and what I might do differently next time.
</p>

<p>
I'll start with a brief history of the tools I chose, and why I decided to use
them.  The next post will get into the nitty gritty, step by step analysis of
each piece of code I wrote, and why I foolishly thought each decision was a good
one.
</p>

<p>
So, here's how I made the website you're currently viewing, using two ancient and
obscure tools: <a target="_blank" href="https://www.gnu.org/software/emacs/">Emacs</a> and <a target="_blank" href="https://orgmode.org/">Org-Mode</a>. If you don't know what these are, don't
worry, because that's what I'll be covering first.
</p>
</div>
</div>
<div id="outline-container-org4f44ad3" class="outline-2">
<h2 id="org4f44ad3">Emacs [sounds like: eeeee-max]</h2>
<div class="outline-text-2" id="text-org4f44ad3">
<p>
What the hell is Emacs, anyway? I know I'm throwing some unfamiliar terminology
at you, but bear with me.
</p>

<p>
Emacs is a text editor. Well, sort of. It's also customizable to its core, and,
even though many consider it a relic of the past, it's still widely used. By a
small subsets of programmers between the ages of 50-100.
</p>
</div>
<div id="outline-container-orgcd9b25d" class="outline-3">
<h3 id="orgcd9b25d"><span class="todo TODO">TODO</span> Picture here</h3>
<div class="outline-text-3" id="text-orgcd9b25d">
<p>
With its first public release in <a target="_blank" href="https://www.gnu.org/software/emacs/history.html">1985</a>, the idea of Emacs began <a target="_blank" href="https://www.emacswiki.org/emacs/EmacsHistory">taking shape</a> when
programmers at the MIT Artificial Intelligence Laboratory wanted to make
improvements to their existing text editor, TECO. One feature that came from
this AI lab and was integral to the success of Emacs was <i>display-editing</i>, or the
ability to view changes on your screen as you typed out commands. You know,
instead of waiting for it to be printed out on a piece of paper. Another feature
was <i>editor macros</i>, or the ability to define keyboard shortcuts for a series of
commands. And from <i>(Text) Editor MACroS</i> with <i>display-editing</i>, Emacs emerges&#x2026;
</p>

<p>
None of this is really important, but still interesting I think.
</p>

<p>
All that to say, I use an app called Emacs on my computer, to write the code
that made up this website. You may as well use Notepad or TextEdit, and would
likely have a much nicer time.
</p>
</div>
</div>
<div id="outline-container-org9da2c81" class="outline-3">
<h3 id="org9da2c81"><span class="todo TODO">TODO</span> Put some pictures here!</h3>
</div>
</div>
<div id="outline-container-org9fa8701" class="outline-2">
<h2 id="org9fa8701">Org-Mode [sounds like&#x2026; org-mode]</h2>
<div class="outline-text-2" id="text-org9fa8701">
<p>
If, for whatever reason, you thought this would be some newfangled technology,
think again!
</p>

<p>
Org-Mode is a feature built into Emacs for creating helpful organizational
documents. Think outlines, to-do lists, research papers, and so on. If you've
worked with markdown, it's kind of of similar. Sort of. Its initial release was
in 2003.
</p>
</div>
<div id="outline-container-org52bf06b" class="outline-3">
<h3 id="org52bf06b"><span class="todo TODO">TODO</span> Picture here of org-mode syntax, and maybe markdown syntax?</h3>
<div class="outline-text-3" id="text-org52bf06b">
<p>
Each page on this website is more or less written as a text file. Org-Mode
provides an interesting feature for converting these org files into HTML
ones. HTML files simply define the structure of a website page, including all of
the information you're viewing, like this text here!
</p>
</div>
</div>
<div id="outline-container-org64e8077" class="outline-3">
<h3 id="org64e8077"><span class="todo TODO">TODO</span> Put some pictures here!</h3>
</div>

<div id="outline-container-org7282f79" class="outline-3">
<h3 id="org7282f79"><span class="todo TODO">TODO</span> Put a link to an org file example?</h3>
</div>
</div>
<div id="outline-container-orgd40b2ee" class="outline-2">
<h2 id="orgd40b2ee">So&#x2026; Why?</h2>
<div class="outline-text-2" id="text-orgd40b2ee">
<p>
Why would I decide to use tools that are quite old, have a dwindling user-base,
and often leave me frustrated trying to figure out basic functionality?
</p>

<p>
Great question. I could tell you that I enjoy a challenge, or that it's a good learning experience, and that wouldn't be untrue.
</p>

<p>
Honestly, my computer's just old. Old, slow, and still kickin'!
</p>

<p>
A 2014 MacBook Air, with 4 gigs of ram and a sad excuse for a keyboard, had new
life breathed into it after I replaced the operating system with Linux Mint (a
free operating system, as opposed to MacOS or Windows). All of a sudden I could
boot up the laptop quickly and browse the internet without <i>as much</i> lag. I was
ecstatic.
</p>

<p>
And then, I tried running Visual Studio Code, the main application I would be
programming in. Maybe there's something I missed, like turning off all the
important features, but it was still too slow for me to handle. 5-10 seconds is
a painful amount of time to wait to view a small change.
</p>

<p>
But Emacs&#x2026; Emacs isn't slow&#x2026; Emacs starts up pretty quickly, doesn't lag
much. And, what's this? I can natively compile my plugins, too?
</p>

<p>
Now we're talkin'.
</p>
</div>
</div>
<div id="outline-container-orge6795c1" class="outline-2">
<h2 id="orge6795c1">Building out the site</h2>
<div class="outline-text-2" id="text-orge6795c1">
<p>
Native compiling, you ask? Oh, that just makes computer go fast. Well,
faster. Maybe I'll talk about it in a later blog post, but I promise. It's very
cool.
</p>

<p>
My goal in this project was to create a streamlined and simplified process for
editing and publishing text files as a website. As we've established, I enjoy
punishing myself by learning to use old, obscure tools while trying to finish an
otherwise simple project, and most of my effort was spent in this regard. 
</p>



<p>
Org-Mode provides that handy-dandy feature to convert all my org files into HTML
files. It's especially useful if you want your website to look like as dry and
boring as possible, with extra, unnecessary features.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer><span><i class="bi bi-heart"></i> made with <a href="https://www.gnu.org/software/emacs/" target="_blank">emacs</a>, <a href="https://orgmode.org/" target="_blank">org-mode</a>, and love <i class="bi bi-heart"></i></span><br><a target="_blank" href="https://validator.w3.org/check?uri=https://kothman.github.io">w3c validation</a></footer>
</div>
</body>
</html>
